from python_code.main import *

# =============================================================
# Метод Гаусса для решения СЛАУ, обратная матрица и оределитель
# =============================================================


try:
    # Матрица из задания
    matrix = Матрица([
        [-11, 7, -1, 6],
        [-11, -9, 2, -7],
        [9, -3, 1, -2],
        [-5, 4, -1, -11]
    ])
    # Столбец свободных членов
    free_column = [74, 60, -54, -66]

    # ============================================================
    # ВНИМАНИЕ! Пугливым ниже не смотреть! Дальше программный код!
    # ATTENTION!  Not for timid people! Below is the program code!
    # ============================================================

    print("Введенная матрица:")
    matrix.показать_в_консоли()

    print(f'Определитель данной матрицы равен {определитель(matrix)}\n')

    print("Матрица, обратная данной:")
    (~matrix).показать_в_консоли()

    print('\n' + " Решение методом Гаусса для данной СЛАУ: ".center(75, '='))
    decision = gauss.gauss_method(matrix.копия(), free_column, level_of_details=2)
    for step in decision:
        for info in step:
            if 'Матрица' in info:
                step[info].показать_в_консоли()
            else:
                print(f"{info}: {step[info]}")

except Exception as error:
    print(error)
input('Нажмите "Enter" чтобы выйти...')
