try:
	x = [2, 3, 4, 5]
	y = [-2, 2, 0, 3]

	print('\n//////////////////////////////////////')
	print('Вычислим длины отрезков')
	print('//////////////////////////////////////\n')

	h2 = x[1] - x[0]
	h3 = x[2] - x[1]
	h4 = x[3] - x[2]

	print(f'h2 = {h2}')
	print(f'h3 = {h3}')
	print(f'h4 = {h4}')

	print('////////////////////////////////////////////')
	print('Вычислим правые части Yi и запишем систему ')
	print('////////////////////////////////////////////\n')

	Y2 = (y[2] - y[1]) / h3 - (y[1] - y[0]) / h2
	Y3 = (y[3] - y[2]) / h4 - (y[2] - y[1]) / h3

	print('/')
	print(f'| {h2 / 6}*m1 + {(h2 + h3) / 3}*m2 + {h3 / 6}*m3 = {Y2}')
	print(f'| {h3 / 6 }*m2 + {(h3 + h4) / 3}*m3 + {h4 / 6}*m4 = {Y3}')
	print('|\n')

	print('Так как m1 = m5 = 0, перепишем систему как:\n')
	print('/')
	print(f'| {(h2 + h3) / 3}*m2 + {h3 / 6}*m3 = {Y2}')
	print(f'| {h3 / 6}*m2 + {(h3 + h4) / 3}*m3 + {h4 / 6}*m4 = {Y3}')
	print('|\n')

	print('//////////////////////////////////////')
	print('Вычислим прогоночные коэффициенты:')
	print('//////////////////////////////////////\n')

	P2 = 0
	Q2 = 0
	P3 = (-h3) / (2 * (h2 + h3) + P2 * h2)
	Q3 = (6 * Y2 - h2 * Q2) / (2 * (h3 + h2) + P2 * h2)
	P4 = (-h4) / (2 * (h3 + h4) + P3 * h3)
	Q4 = (6 * Y3 - h3 * Q3) / (2 * (h4 + h3) + P3 * h3)

	print(f'P2 = {P2}')
	print(f'Q2 = {Q2}')
	print('------------------------------')
	print(f'P3 = {P3}')
	print(f'Q3 = {Q3}')
	print('------------------------------')
	print(f'P4 = {P4}')
	print(f'Q4 = {Q4}')

	print('//////////////////////////////////////')
	print('Вычислим mi:')
	print('//////////////////////////////////////\n')

	m3 = P4 * m4 + Q4
	m2 = P3 * m3 + P3

	print(f'm3 = {m3}')
	print(f'm2 = {m2}')

except Exception as error:
	print(error)
input('\nНажмите "Enter" чтобы выйти...')