дробное_число = float
целое_число = int
строка = str
список = list
кортеж = tuple
словарь = dict
множество = set
логический = bool

напечатать_в_консоль = print
модуль = abs
класс_является_подклассом = isinstance
тип = type
округлить = round
все = all
что_то = any
выполнить = eval
ввести_с_клавиатуры = input
длина = len
применить_ко_всем = map
развернуть = reversed
сумма_всех = sum
минимальное_значение = min
максимальное_значение = max
свойство = property
диапазон = range



def возвести_в_степень(число, степень):
    return число ** степень


def извлечь_корень(число, степень):
    return число ** (1 / степень)
